dakejahl/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	// For each dshot channel:
	// - allocate DMA for Capture Compare (receive)
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {
		if (_channels_init_mask & (1 << output_channel)) {
			uint8_t timer_index = timer_io_channels[output_channel].timer_index;
			uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

			DMA_HANDLE* dma_handle = &dshot_handler[timer_index].dma_ch_handle[timer_channel_index];
			uint32_t dma_map_ch = io_timers[timer_index].dshot.dma_map_ch[timer_channel_index];
			if (dma_map_ch) {
				*dma_handle = stm32_dmachannel(dma_map_ch);
				if (*dma_handle == NULL) {
					PX4_INFO("could not allocate timer %u DMA CH%u handle, output_channel %u", timer_index, timer_channel_index, output_channel);
					return -ENOSR;
				}

				// This was just for testing. We will initialize again at run time.
				stm32_dmafree(*dma_handle);
				*dma_handle = NULL;
			}
		}
	}

	// TODO: what are we doing here and why can't this be defined at compile time?
	unsigned buffer_offset = 0;

	for (unsigned timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (_timers_init_mask & (1 << timer_index)) {
			if (io_timers[timer_index].base == 0) { // no more timers configured
				break;
			}

			// we know the uint8_t* cast to uint32_t* is fine, since we're aligned to cache line size
#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wcast-align"
			dshot_output_buffer[timer_index] = (uint32_t *) &dshot_burst_buffer_array[buffer_offset];
#pragma GCC diagnostic pop
			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
			buffer_offset += DSHOT_OUTPUT_BUFFER_SIZE(channel_count);

			if (buffer_offset > sizeof(dshot_burst_buffer_array)) {
				return -EINVAL; // something is wrong with the board configuration or some other logic
			}
		}
	}

	return _channels_init_mask;
}

// Kicks off a DMA transmit for each configured timer and the associated channels
void up_dshot_trigger()
{
	cycles++;

			// uint8_t timer_index = timer_io_channels[output_channel].timer_index;
			// uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

			// if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] != NULL) {
			// 	stm32_dmastop(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
			// 	stm32_dmafree(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
			// 	dshot_handler[timer_index].dma_ch_handle[timer_channel_index] = NULL;
			// }

			// up_invalidate_dcache((uintptr_t)dshot_capture_buffer[output_channel],
			// 		 (uintptr_t)dshot_capture_buffer[output_channel] +
			// 		 sizeof(dshot_capture_buffer[output_channel]));


			// // TODO: do we need to unallocate / reinit timers here? It's done at the start..
			// io_timer_unallocate_channel(output_channel);
			// io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);


	if (_bidirectional) {
		// For each channel, bidirectional dshot needs to initialize each timer every time
		for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

			// Get timer indicies and timer channel indices
			uint8_t timer_index = timer_io_channels[output_channel].timer_index;
			uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

			// Free DMA if still allocated from previous attempt
			if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] != NULL) {
				stm32_dmastop(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
				stm32_dmafree(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
				dshot_handler[timer_index].dma_ch_handle[timer_channel_index] = NULL;
			}

			// Invalidate dcache from previous attempt
			up_invalidate_dcache((uintptr_t)dshot_capture_buffer[output_channel],
					 (uintptr_t)dshot_capture_buffer[output_channel] +
					 sizeof(dshot_capture_buffer[output_channel]));

			// Re-initialize timer channels
			if (_channels_init_mask & (1 << output_channel)) {
				io_timer_unallocate_channel(output_channel);
				int ret = io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
				if (ret != OK) {
					PX4_INFO("io_timer_channel_init %u failed", output_channel);
					return;
				}
			}


			// io_timer_capture_dma_req(timer_index, false);
		}

		// For each timer, bidirectional dshot needs to initialize DMA UP each time
		// for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		// 	if (_timers_init_mask & (1 << timer_index)) {
		// 		if (dshot_handler[timer_index].dma_up_handle != NULL) {
		// 			stm32_dmastop(dshot_handler[timer_index].dma_up_handle);
		// 			stm32_dmafree(dshot_handler[timer_index].dma_up_handle);
		// 			dshot_handler[timer_index].dma_up_handle = NULL;
		// 		}
		// 	}
		// }
	}

	// Enable all timers configured as dshot (weird way of doing this...)
	io_timer_set_enable(true, _bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot,
				IO_TIMER_ALL_MODES_CHANNELS);

	// For each timer, begin DMA transmit
	for (uint8_t timer_index = 0; timer_index < MAX_IO_TIMERS; timer_index++) {
		if (_timers_init_mask & (1 << timer_index)) {

			// Set timer in dshot mode
			uint32_t channel_count = io_timers_channel_mapping.element[timer_index].channel_count_including_gaps;
			io_timer_set_dshot_mode(timer_index, _dshot_frequency, channel_count);

			// Allocate DMA if necessary
			if (dshot_handler[timer_index].dma_up_handle == NULL) {

				dshot_handler[timer_index].dma_up_handle = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_up);

				if (dshot_handler[timer_index].dma_up_handle == NULL) {
					PX4_INFO("DMA allocation for timer %u failed", timer_index);
					return;
				}

				dmaupallocatedcount++;
			}

			// Flush cache so DMA sees the data
			up_clean_dcache((uintptr_t) dshot_output_buffer[timer_index],
					(uintptr_t) dshot_output_buffer[timer_index] +
					DSHOT_OUTPUT_BUFFER_SIZE(channel_count));

			px4_stm32_dmasetup(dshot_handler[timer_index].dma_up_handle,
					   io_timers[timer_index].base + STM32_GTIM_DMAR_OFFSET,
					   (uint32_t)(dshot_output_buffer[timer_index]),
					   channel_count * CHANNEL_OUTPUT_BUFF_SIZE,
					   DSHOT_DMA_SCR);

			// Clean UDE flag before DMA is started
			io_timer_update_dma_req(timer_index, false);

			// Trigger DMA (DShot Outputs)
			timer_index_array[timer_index] = timer_index;


