dakejahl/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
			if (_bidirectional) {
				stm32_dmastart(dshot_handler[timer_index].dma_up_handle, dma_callback_capture_start, &timer_index_array[timer_index], false);

			} else {
				stm32_dmastart(dshot_handler[timer_index].dma_up_handle,  NULL, NULL, false);
			}

			// Enable DMA update request
			io_timer_update_dma_req(timer_index, true);
			px4_arch_gpiowrite(GPIO_FMU_CH8, true);
		}
	}
}

void dma_callback_capture_start(DMA_HANDLE handle, uint8_t status, void *arg)
{
	px4_arch_gpiowrite(GPIO_FMU_CH8, false);

	uint8_t timer_index = *((uint8_t*)arg);

	dmastatus_dma_up[timer_index] = status;

	interruptcounter++;

	// Clean DMA UP configuration
	if (dshot_handler[timer_index].dma_up_handle != NULL) {
		stm32_dmastop(dshot_handler[timer_index].dma_up_handle);
		stm32_dmafree(dshot_handler[timer_index].dma_up_handle);
		dshot_handler[timer_index].dma_up_handle = NULL;
		dmaupdeallocatedcount++;
	}

	// Disable DMA capture request
	io_timer_capture_dma_req(timer_index, false);

	// Allocate DMA for all channels on this timer
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		// if (output_channel != 0) {
		// 	continue;
		// }

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		bool channel_enabled = _channels_init_mask & (1 << output_channel);

		if (is_this_timer && channel_enabled) {
			uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

			// Allocate DMA
			if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				dshot_handler[timer_index].dma_ch_handle[timer_channel_index] = stm32_dmachannel(io_timers[timer_index].dshot.dma_map_ch[timer_channel_index]);
				dmaupallocatedcountarray[output_channel]++;
			} else {
				dmanotallocated++;
			}

			// If DMA handler is valid, start DMA
			if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] == NULL) {
				PX4_INFO("failed to allocate dma for timer %u channel %u", timer_index, timer_channel_index);
				continue;
			}

			// Flush cache so DMA sees the data
			memset(dshot_capture_buffer[output_channel], 0, sizeof(dshot_capture_buffer[output_channel]));
			up_clean_dcache((uintptr_t)dshot_capture_buffer[output_channel],
				(uintptr_t)dshot_capture_buffer[output_channel] +
				sizeof(dshot_capture_buffer[output_channel]));

			// Setup DMA for this channel
			px4_stm32_dmasetup(dshot_handler[timer_index].dma_ch_handle[timer_channel_index],
					   io_timers[timer_index].base + STM32_GTIM_DMAR_OFFSET, // DMA address for burst mode (16-bit, TIM2-5 only)
					   (uint32_t) dshot_capture_buffer[output_channel],
					   CHANNEL_CAPTURE_BUFF_SIZE,
					   DSHOT_BIDIRECTIONAL_DMA_SCR);

			// Reset / Enable timer channel
			io_timer_unallocate_channel(output_channel);
			io_timer_channel_init(output_channel, IOTimerChanMode_CaptureDMA, NULL, NULL);
			io_timer_set_enable(true, IOTimerChanMode_CaptureDMA, 1 << output_channel);

			// Enable input capture on this channel
			up_input_capture_set(output_channel, Both, 0, NULL, NULL);

			// Setup dshot capture for this channel
			io_timer_set_dshot_capture_mode(timer_index, _dshot_frequency, output_channel);

			// Start DMA with callback if bidi dshot is enabled
			output_channel_array[output_channel] = output_channel;
			// stm32_dmastart(dshot_handler[timer_index].dma_ch_handle[timer_channel_index], dma_callback_capture_complete, &output_channel_array[output_channel], false);


			// NOTE: we can't use DMA callback since GCR encoding means the number of pulses in the pulse train (eRPM frame)
			// is variable. The number of pulses (which are decoded into uint16_t) is variable and depends on the frame.
			// Instead we must use a timer callback since dshot frames have fixed timings.
			stm32_dmastart(dshot_handler[timer_index].dma_ch_handle[timer_channel_index], NULL, NULL, false);

			// It takes ~50us, we we'll wait 75us
			hrt_call_after(&_dma_capture_callback_call[output_channel], 75, dma_callback_capture_complete, &output_channel_array[output_channel]);

			if (output_channel == 0) {
				px4_arch_gpiowrite(GPIO_FMU_CH8, true);
			}
		}
	}

	// Enable DMA capture compare on this timer
	io_timer_capture_dma_req(timer_index, true);
}

// static void dma_callback_capture_complete_timeout(void *arg)
// {
// 	uint8_t output_channel = *((uint8_t*)arg);

// 	capturecompletetimeout[output_channel]++;

// 	uint8_t timer_index = timer_io_channels[output_channel].timer_index;
// 	uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

// 	if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] != NULL) {
// 		stm32_dmastop(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
// 		stm32_dmafree(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
// 		dshot_handler[timer_index].dma_ch_handle[timer_channel_index] = NULL;
// 	}

// 	up_invalidate_dcache((uintptr_t)dshot_capture_buffer[output_channel],
// 			 (uintptr_t)dshot_capture_buffer[output_channel] +
// 			 sizeof(dshot_capture_buffer[output_channel]));

// 	io_timer_unallocate_channel(output_channel);
// 	io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
// }

static void dma_callback_capture_complete(void *arg)
{
	irqstate_t flags = px4_enter_critical_section();

	uint8_t output_channel = *((uint8_t*)arg);

	capturecompletecounter++;

	// TODO: capture complete callback firing too early? Data is zero...
	uint8_t timer_index = timer_io_channels[output_channel].timer_index;
	uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

	capturecompletechannel[output_channel] = output_channel;

	if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] != NULL) {
		stm32_dmastop(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
		stm32_dmafree(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
		dshot_handler[timer_index].dma_ch_handle[timer_channel_index] = NULL;
	}

	up_invalidate_dcache((uintptr_t)dshot_capture_buffer[output_channel],
			 (uintptr_t)dshot_capture_buffer[output_channel] +
			 sizeof(dshot_capture_buffer[output_channel]));

	process_capture_results(output_channel);

	// TODO: do we need to unallocate / reinit timers here? It's done at the start..
	io_timer_unallocate_channel(output_channel);
	io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);

	if (output_channel == 0) {
		px4_arch_gpiowrite(GPIO_FMU_CH8, false);
	}

	px4_leave_critical_section(flags);
}

// static void dma_callback_capture_complete(DMA_HANDLE handle, uint8_t status, void *arg)
// {
// 	uint8_t output_channel = *((uint8_t*)arg);

