dakejahl/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
// 	// cancel watchdog
// 	hrt_cancel(&_dma_capture_callback_call[output_channel]);

// 	capturecompletecounter++;

// 	if (output_channel == 0) {
// 		px4_arch_gpiowrite(GPIO_FMU_CH8, false);
// 	}

// 	dmastatus_dma_ch[output_channel] = status;

// 	// TODO: capture complete callback firing too early? Data is zero...
// 	uint8_t timer_index = timer_io_channels[output_channel].timer_index;
// 	uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;

// 	capturecompletechannel[output_channel] = output_channel;

// 	if (dshot_handler[timer_index].dma_ch_handle[timer_channel_index] != NULL) {
// 		stm32_dmastop(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
// 		stm32_dmafree(dshot_handler[timer_index].dma_ch_handle[timer_channel_index]);
// 		dshot_handler[timer_index].dma_ch_handle[timer_channel_index] = NULL;
// 	}

// 	up_invalidate_dcache((uintptr_t)dshot_capture_buffer[output_channel],
// 			 (uintptr_t)dshot_capture_buffer[output_channel] +
// 			 sizeof(dshot_capture_buffer[output_channel]));

// 	process_capture_results(output_channel);

// 	// TODO: do we need to unallocate / reinit timers here? It's done at the start..
// 	io_timer_unallocate_channel(output_channel);
// 	io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);

// 	px4_arch_gpiowrite(GPIO_FMU_CH8, true);
// }

void process_capture_results(int8_t output_channel)
{
	// const unsigned period = calculate_period_from_erpm_frame((uint8_t*)dshot_capture_buffer[output_channel], sizeof(dshot_capture_buffer[output_channel]));
	const unsigned period = calculate_period_from_erpm_frame(dshot_capture_buffer[output_channel], CHANNEL_CAPTURE_BUFF_SIZE);


	if (period == 0) {
		// If the parsing failed, we get 0.
		_erpms[output_channel] = 0;

	} else if (period == 65408) {
		// For still, we get this magic 65408 value.
		_erpms[output_channel] = 0;

	} else {
		// from period in us to eRPM
		_erpms[output_channel] = 1000000 * 60 / period;
	}
}

/**
* bits 	1-11	- throttle value (0-47 are reserved, 48-2047 give 2000 steps of throttle resolution)
* bit 	12		- dshot telemetry enable/disable
* bits 	13-16	- XOR checksum
**/
void dshot_motor_data_set(unsigned channel, uint16_t throttle, bool telemetry)
{
	if (!(_channels_init_mask & (1 << channel))) {
		// this channel is not configured for dshot
		return;
	}

	uint16_t packet = 0;
	uint16_t checksum = 0;

	packet |= throttle << DSHOT_THROTTLE_POSITION;
	packet |= ((uint16_t)telemetry & 0x01) << DSHOT_TELEMETRY_POSITION;

	uint16_t csum_data = packet;

	/* XOR checksum calculation */
	csum_data >>= NIBBLES_SIZE;

	for (unsigned i = 0; i < DSHOT_NUMBER_OF_NIBBLES; i++) {
		checksum ^= (csum_data & 0x0F); // XOR data by nibbles
		csum_data >>= NIBBLES_SIZE;
	}

	if (_bidirectional) {
		packet |= ((~checksum) & 0x0F);

	} else {
		packet |= ((checksum) & 0x0F);
	}

	unsigned timer = timer_io_channels[channel].timer_index;

	uint32_t *buffer = dshot_output_buffer[timer];
	const io_timers_channel_mapping_element_t *mapping = &io_timers_channel_mapping.element[timer];
	unsigned num_motors = mapping->channel_count_including_gaps;
	unsigned timer_channel = timer_io_channels[channel].timer_channel - mapping->lowest_timer_channel;

	for (unsigned motor_data_index = 0; motor_data_index < ONE_MOTOR_DATA_SIZE; motor_data_index++) {
		buffer[motor_data_index * num_motors + timer_channel] =
			(packet & 0x8000) ? MOTOR_PWM_BIT_1 : MOTOR_PWM_BIT_0;  // MSB first
		packet <<= 1;
	}
}

int up_dshot_arm(bool armed)
{
	return io_timer_set_enable(armed, _bidirectional ? IOTimerChanMode_DshotInverted : IOTimerChanMode_Dshot,
				   IO_TIMER_ALL_MODES_CHANNELS);
}

int up_bdshot_get_erpm(uint8_t channel, int *erpm)
{
	if (_channels_init_mask & (1 << channel)) {
		*erpm = _erpms[channel];
		return PX4_OK;
	}
	// this channel is not configured for dshot
	return PX4_ERROR;
}

int up_bdshot_channel_status(uint8_t channel)
{
	// TODO: track that each channel is communicating
	if (_channels_init_mask & (1 << channel)) {
		return 1;
	}

	return 0;
}

void up_bdshot_status(void)
{
	PX4_INFO("dshot driver stats: read %lu, failed nibble %lu, failed CRC %lu, invalid/zero %lu",
		read_ok, read_fail_nibble, read_fail_crc, read_fail_zero);

	// PX4_INFO("ch0 %ld, ch1 %ld, ch2 %ld, ch3 %ld,", _erpms[0], _erpms[1], _erpms[2], _erpms[3]);

	int32_t* jc = capturecompletechannel;
	PX4_INFO("ch0 %ld, ch1 %ld, ch2 %ld, ch3 %ld, ch4 %ld, ch5 %ld, ch6 %ld, ch7 %ld,", jc[0], jc[1], jc[2], jc[3], jc[4], jc[5], jc[6], jc[7]);

	PX4_INFO("dmaupallocatedcount %lu", dmaupallocatedcount);
	PX4_INFO("dmaupdeallocatedcount %lu", dmaupdeallocatedcount);
	PX4_INFO("dmanotallocated %lu", dmanotallocated);

	PX4_INFO("cycles %lu", cycles);
	PX4_INFO("interruptcounter %lu", interruptcounter);

	uint32_t* jca = dmaupallocatedcountarray;
	PX4_INFO("alloc %ld, alloc %ld, alloc %ld, alloc %ld, alloc %ld, alloc %ld, alloc %ld, alloc %ld,", jca[0], jca[1], jca[2], jca[3], jca[4], jca[5], jca[6], jca[7]);

	uint8_t* stup = dmastatus_dma_up;
	PX4_INFO("st0 %u, st1 %u, st2 %u", stup[0], stup[1], stup[2]);
	uint8_t* st = dmastatus_dma_ch;
	PX4_INFO("st0 %u, st1 %u, st2 %u, st3 %u, st4 %u, st5 %u, st6 %u, st7 %u,", st[0], st[1], st[2], st[3], st[4], st[5], st[6], st[7]);


	PX4_INFO("capturecompletecounter %lu", capturecompletecounter);

	uint32_t* ccto = capturecompletetimeout;
	PX4_INFO("ccto0 %lu, ccto1 %lu, ccto2 %lu, ccto3 %lu, ccto4 %lu, ccto5 %lu, ccto6 %lu, ccto7 %lu,", ccto[0], ccto[1], ccto[2], ccto[3], ccto[4], ccto[5], ccto[6], ccto[7]);
}

uint8_t nibbles_from_mapped(uint8_t mapped)
{
	switch (mapped) {
	case 0x19:
		return 0x00;

	case 0x1B:
		return 0x01;

	case 0x12:
		return 0x02;

	case 0x13:
		return 0x03;

	case 0x1D:
		return 0x04;

	case 0x15:
		return 0x05;

	case 0x16:
		return 0x06;

	case 0x17:
		return 0x07;

	case 0x1a:
		return 0x08;

	case 0x09:
		return 0x09;

	case 0x0A:
		return 0x0A;

	case 0x0B:
		return 0x0B;

	case 0x1E:
		return 0x0C;

	case 0x0D:
		return 0x0D;

	case 0x0E:
		return 0x0E;

	case 0x0F:
		return 0x0F;

	default:
		// Unknown mapped
		return 0xFF;
	}
}

unsigned calculate_period_from_erpm_frame(uint16_t* buffer, size_t buffer_size)
{
	uint32_t value = 0;

	// We start off with high
	uint32_t high = 1;

	unsigned shifted = 0;
	unsigned previous = 0;

	for (unsigned i = 1; i < buffer_size; ++i) {

		// We can ignore the very first data point as it's the pulse before it starts.
		if (i > 1) {

